tets = [
    # 1. 막대형
    [(0,1), (0,2), (0,3)], [(1,0), (2,0), (3,0)], 

    # 2. 정사각형
    [(0,1), (1,0), (1,1)],

    # 3. L자형
    [(1,0), (1,1), (2,1)], [(0,-1), (1,-1), (1,-2)],
    [(1,0), (1,-1), (2,-1)], [(0,1), (1,1), (1,2)],
    [(1,0), (2,0), (2,1)], [(0,1), (0,2), (1,0)], 
    [(0,1), (1,1), (2,1)], [(0,1), (0,2), (-1,2)],
    [(1,0), (2,0), (2,-1)], [(0,1), (0,2), (1,2)], 
    [(1,0), (2,0), (0,1)], [(1,0), (1,1), (1,2)],

    # 4. 번개형 (Z, S)
    [(1,0), (1,1), (2,0)], [(0,-1), (1,0), (0,1)], 
    [(0,1), (-1,1), (1,1)], [(1,0), (1,-1), (1,1)]
]

ans = 0  

n, m = map(int, input().split())
arr = [list(map(int, input().split())) for _ in range(n)]

for i in range(n):
	for j in range(m):
		for tet in tets:
			temp = arr[i][j]
			valid = True

			for di, dj in tet:
				ni, nj = i + di, j + dj
				if 0 <= ni < n and 0 <= nj < m:
					temp += arr[ni][nj]
				else:
					valid = False
					break
			if valid:
				ans = max(ans, temp)

print(ans)